import TerminalController from '../TerminalController';
import './About.css'

const About = () => {
    const prompt = 'guest@kangsk.dev:/about$';
    const initialInput = '';

    /*
     * DISPLAY ONE 
     */
    const initialDisplayTitle1 = [
        '███████╗ █████╗ ███╗   ██╗ ██████╗ ██╗  ██╗██╗   ██╗███████╗ ██████╗ ██╗  ██╗',
        '██╔════╝██╔══██╗████╗  ██║██╔════╝ ██║  ██║╚██╗ ██╔╝██╔════╝██╔═══██╗██║ ██╔╝',
        '███████╗███████║██╔██╗ ██║██║  ███╗███████║ ╚████╔╝ █████╗  ██║   ██║█████╔╝ ',
        '╚════██║██╔══██║██║╚██╗██║██║   ██║██╔══██║  ╚██╔╝  ██╔══╝  ██║   ██║██╔═██╗ ',
        '███████║██║  ██║██║ ╚████║╚██████╔╝██║  ██║   ██║   ███████╗╚██████╔╝██║  ██╗',
        '╚══════╝╚═╝  ╚═╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝  ╚═╝   ╚═╝   ╚══════╝ ╚═════╝ ╚═╝  ╚═╝'
    ].map(text => {
        return (<div className="AboutInitialDisplayTitle1" enableTypeAnimation={ 'true' } typeAnimationText={ text } typeAnimationGroup={ 1 } enableDeleteAnimation={ 'true' } deleteAnimationGroup={ 2 } deleteAnimationDelay={ 1000 } style={{ height: 0 }}></div>);
    });

    const initialDisplayTitle2 = [
        '                                                                             ',
        '██╗  ██╗ █████╗ ███╗   ██╗ ██████╗                                           ',
        '██║ ██╔╝██╔══██╗████╗  ██║██╔════╝                                           ',
        '█████╔╝ ███████║██╔██╗ ██║██║  ███╗                                          ',
        '██╔═██╗ ██╔══██║██║╚██╗██║██║   ██║                                          ',
        '██║  ██╗██║  ██║██║ ╚████║╚██████╔╝                                          ',
        '╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝ ╚═════╝                                           '
    ].map(text => {
        return (<div className="AboutInitialDisplayTitle1" enableTypeAnimation={ 'true' } typeAnimationText={ text } typeAnimationGroup={ 2 } enableDeleteAnimation={ 'true' } deleteAnimationGroup={ 2 } deleteAnimationDelay={ 1000 } style={{ height: 0 }}></div>);
    });

    const initialDisplayTitleContainer1 = <div className='AboutInitialDisplayTitleContainer1'>{ initialDisplayTitle1 }{ initialDisplayTitle2 }</div>
    const initialDisplayElements1 = <div className='AboutInitialDisplayTitleAndImageContainer'>{ initialDisplayTitleContainer1 } <img className='AboutHeadshotImage' src='/Headshot.png'></img></div>

    /*
     * DISPLAY TWO 
     */
    const initialDisplayTitle3 = [
        '██╗     █████╗ ███╗   ███╗     █████╗                      ',
        '██║    ██╔══██╗████╗ ████║    ██╔══██╗                     ',
        '██║    ███████║██╔████╔██║    ███████║                     ',
        '██║    ██╔══██║██║╚██╔╝██║    ██╔══██║                     ',
        '██║    ██║  ██║██║ ╚═╝ ██║    ██║  ██║    ██╗    ██╗    ██╗',
        '╚═╝    ╚═╝  ╚═╝╚═╝     ╚═╝    ╚═╝  ╚═╝    ╚═╝    ╚═╝    ╚═╝'
    ].map(text => {
        return (<div className="AboutInitialDisplayTitle1" enableTypeAnimation={ 'true' } typeAnimationText={ text } typeAnimationGroup={ 3 } ></div>);
    });

    const initialDisplayTitle4 = [
        '                                                                                                                                                                                                                                               ',
        '                                                                                                                                                                                                                                               ',
        '                                                                                                                                                                                                                                               ',
        '                                                                                                                                                                                                                                               ',
        '                                                                                                                                                                                                                                               ',
        ' ██████╗███████╗    ███████╗████████╗██╗   ██╗██████╗ ███████╗███╗   ██╗████████╗     █████╗ ████████╗    ██████╗  ██████╗ ███████╗████████╗ ██████╗ ███╗   ██╗    ██╗   ██╗███╗   ██╗██╗██╗   ██╗███████╗██████╗ ███████╗██╗████████╗██╗   ██╗',
        '██╔════╝██╔════╝    ██╔════╝╚══██╔══╝██║   ██║██╔══██╗██╔════╝████╗  ██║╚══██╔══╝    ██╔══██╗╚══██╔══╝    ██╔══██╗██╔═══██╗██╔════╝╚══██╔══╝██╔═══██╗████╗  ██║    ██║   ██║████╗  ██║██║██║   ██║██╔════╝██╔══██╗██╔════╝██║╚══██╔══╝╚██╗ ██╔╝',
        '██║     ███████╗    ███████╗   ██║   ██║   ██║██║  ██║█████╗  ██╔██╗ ██║   ██║       ███████║   ██║       ██████╔╝██║   ██║███████╗   ██║   ██║   ██║██╔██╗ ██║    ██║   ██║██╔██╗ ██║██║██║   ██║█████╗  ██████╔╝███████╗██║   ██║    ╚████╔╝ ',
        '██║     ╚════██║    ╚════██║   ██║   ██║   ██║██║  ██║██╔══╝  ██║╚██╗██║   ██║       ██╔══██║   ██║       ██╔══██╗██║   ██║╚════██║   ██║   ██║   ██║██║╚██╗██║    ██║   ██║██║╚██╗██║██║╚██╗ ██╔╝██╔══╝  ██╔══██╗╚════██║██║   ██║     ╚██╔╝  ',
        '╚██████╗███████║    ███████║   ██║   ╚██████╔╝██████╔╝███████╗██║ ╚████║   ██║       ██║  ██║   ██║       ██████╔╝╚██████╔╝███████║   ██║   ╚██████╔╝██║ ╚████║    ╚██████╔╝██║ ╚████║██║ ╚████╔╝ ███████╗██║  ██║███████║██║   ██║      ██║   ',
        ' ╚═════╝╚══════╝    ╚══════╝   ╚═╝    ╚═════╝ ╚═════╝ ╚══════╝╚═╝  ╚═══╝   ╚═╝       ╚═╝  ╚═╝   ╚═╝       ╚═════╝  ╚═════╝ ╚══════╝   ╚═╝    ╚═════╝ ╚═╝  ╚══                                                                                  '
    ].map(text => {
        return (<div className="AboutInitialDisplayTitle2" enableTypeAnimation={ 'true' } typeAnimationText={ text } typeAnimationGroup={ 4 } typeAnimationInterval={ 5 } enableDeleteAnimation='true' deleteAnimationGroup={ 4 } deleteAnimationInterval={ 5 }></div>);
    });

    const initialDisplayTitle5 = [
        '                                                                                                                                        ',
        '                                                                                                                                        ',
        '                                                                                                                                        ',
        '                                                                                                                                        ',
        '                                                                                                                                        ',
        '███████╗ ██████╗ ███████╗████████╗██╗    ██╗ █████╗ ██████╗ ███████╗    ███████╗███╗   ██╗ ██████╗ ██╗███╗   ██╗███████╗███████╗██████╗ ',
        '██╔════╝██╔═══██╗██╔════╝╚══██╔══╝██║    ██║██╔══██╗██╔══██╗██╔════╝    ██╔════╝████╗  ██║██╔════╝ ██║████╗  ██║██╔════╝██╔════╝██╔══██╗',
        '███████╗██║   ██║█████╗     ██║   ██║ █╗ ██║███████║██████╔╝█████╗      █████╗  ██╔██╗ ██║██║  ███╗██║██╔██╗ ██║█████╗  █████╗  ██████╔╝',
        '╚════██║██║   ██║██╔══╝     ██║   ██║███╗██║██╔══██║██╔══██╗██╔══╝      ██╔══╝  ██║╚██╗██║██║   ██║██║██║╚██╗██║██╔══╝  ██╔══╝  ██╔══██╗',
        '███████║╚██████╔╝██║        ██║   ╚███╔███╔╝██║  ██║██║  ██║███████╗    ███████╗██║ ╚████║╚██████╔╝██║██║ ╚████║███████╗███████╗██║  ██║',
        '╚══════╝ ╚═════╝ ╚═╝        ╚═╝    ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝    ╚══════╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝╚═╝  ╚═══╝╚══════╝╚══════╝╚═╝  ╚═╝'
    ].map(text => {
        return (<div className="AboutInitialDisplayTitle2" enableTypeAnimation={ 'true' } typeAnimationText={ text } typeAnimationGroup={ 5 } typeAnimationInterval={ 5 } enableDeleteAnimation='true' deleteAnimationGroup={ 5 } deleteAnimationInterval={ 5 }></div>);
    });

    const initialDisplayElements2 = <div className='AboutInitialDisplayTitleContainer1'>{ initialDisplayTitle3 }{ initialDisplayTitle4 } { initialDisplayTitle5 }</div>

    const handlePageSpecificCommands = (command, args) => {
        let output = [];

        switch (command) {
            case 'help':
                output.push({text: 'kangsk.dev bash, version 1.8.14(1)-release (x86_64-pc-linux-gnu)', color: '#0f0'});
                output.push({text: "These shell commands are defined internally.  Type `help' to see this list.", color: '#0f0'});
                output.push({text: ' '});
                output.push({text: 'Quick Navigation:', color: '#00B2CA'});
                output.push({text: ' '});
                output.push({text: '  home', color: '#00B2CA'});
                output.push({text: "    Change the current working directory to /home. Landing page."});
                output.push({text: ' '});
                output.push({text: '  about', color: '#00B2CA'});
                output.push({text: "    You're already here, silly."});
                output.push({text: ' '});
                output.push({text: '  projects', color: '#00B2CA'});
                output.push({text: '    Change the current working directory to /projects. Contains information about my personal projects.'});
                output.push({text: ' '});
                output.push({text: '  pokemon-ai', color: '#00B2CA'});
                output.push({text: '    Change the current working directory to /pokemon-ai. Watch an AI play Pokemon!'});
                output.push({text: ' '});
                output.push({text: '  terminal', color: '#00B2CA'});
                output.push({text: '    Change the current working directory to /terminal. Access a real Linux terminal.'});
                output.push({text: ' '});
                output.push({text: 'Miscellaneous Information:', color: '#00B2CA'});
                output.push({text: ' '})
                output.push({text: '  socials [-a]', color: '#00B2CA'});
                output.push({text: '    List all social media handles'})
                output.push({text: ' '});
                output.push({text: 'General Commands:', color: '#00B2CA'});
                output.push({text: ' '});
                output.push({text: '  ls', color: '#00B2CA'});
                output.push({text: "    List the current working directory's contents"});
                output.push({text: ' '});
                output.push({text: '  cat [file]', color: '#00B2CA'});
                output.push({text: '    Concatenate files and print on the standard output'});
                output.push({text: ' '});
                output.push({text: '  cd [dir]', color: '#00B2CA'});
                output.push({text: '    Change the current working directory to DIR'});
                break;
        }

        return output;
    }
    
    return (
        <TerminalController
            prompt = { prompt } 
            initialInput = { initialInput }
            handlePageSpecificCommands = { handlePageSpecificCommands }>
                { initialDisplayElements1 }
                { initialDisplayElements2 }
        </TerminalController>
    );
}

export default About;